Repository: vojodotco/vojo
Catalog: vojo_og/translations/vojo_og.*.po
Languages: es

source: Vojo.co Organic Groups Utilities
es: Vojo.co Utilidades de Grupos Orgánicos

source: Customizes from Organic Groups behaviours for the Vojo hosted service
es: Personalizar algunos opciones de grupos orgánicos para el servicio Vojo.co

source: Vojo: Generic Group Menu
es: Vojo: Menú de Grupo Genérico

source: Vojo: Group Details
es: Vojo: Detalles del grupo

source: Home
es: Inicio

source: About
es: Nosotros

source: Submit
es: Enviar

source: Add a new story in this group.
es: Cuéntanos

source: Browse Stories
es: Navegar

source: Map
es: Mapa

source: Unpublished
es: Moderar

source: Members
es: Personas

source: Post your story to this group!
es: Cuéntanos

source: Just send a sms or mms (picture message) from your phone to <em>@email</em>
es: Manda un SMS o MMS de su celular a <em>@email</em>

source: Or call @phone ext. @ext to record your audio story
es: O llama @phone ext. @ext para contarnos una historia en su propia voz.

source: Invite friend
es: Invitar un amigo

source: Manager: !name
es: Administrador: !name

source: My membership
es: Opciones de ser miembro

source: Your membership request awaits approval.
es: Su solicitación está pendiente de aprobación

source: Delete request
es: eliminar su solicitatión
